tutorials/3D/Flow_Around_Sphere/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; // will be change after snappyHexMesh

backgroundMesh
{
    xMin    0;
    xMax    50;
    yMin    0;
    yMax    40;
    zMin    0;
    zMax    40;
    xCells  20;
    yCells  15;
    zCells  15;
}

vertices
(
    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)

    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $:backgroundMesh.xCells
        $:backgroundMesh.yCells
        $:backgroundMesh.zCells
    )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
	type patch;
	faces
	(
	    (0 4 7 3)
	);
    }

    outlet
    {
	type patch;
	faces
	(
	    (6 5 1 2)
	);
    }

    left
    {
	type wall;
	faces
	(
	    (3 7 6 2)
	);
    }

    right
    {
	type wall;
	faces
	(
	    (0 1 5 4)
	);
    }

    front
    {
	type wall;
	faces
	(
	    (4 5 6 7) 
	);
    }

    back
    {
	type wall;
	faces
	(
	    (0 3 2 1) 
	);
    }

    
);

mergePatchPairs
(
);

// ************************************************************************* //
